In [98]:
import pandas as pd

In [99]:
#Series
#DataFrame

In [100]:
list1 = [1, 2 , 3 ,4]
ser = pd.Series(list1)

In [101]:
type(list1)

list

In [102]:
type(ser)

pandas.core.series.Series

In [103]:
ser

0    1
1    2
2    3
3    4
dtype: int64

In [104]:
labels = ["a","b","c","d"]
ser = pd.Series(list1,index = labels)

In [105]:
ser

a    1
b    2
c    3
d    4
dtype: int64

In [106]:
student  = ["Ram","pradeepthi","vaidehi","sudarsan"]
marks = [80,82,84,83]
table = pd.Series(data = marks, index = student)

In [107]:
table

Ram           80
pradeepthi    82
vaidehi       84
sudarsan      83
dtype: int64

In [108]:
dict = {"ram":80,"pradeepthi":65,"gokul":79,"mahati":80}
ser = pd.Series(dict)

In [109]:
ser

ram           80
pradeepthi    65
gokul         79
mahati        80
dtype: int64

In [110]:
ser['mahati']

80

In [111]:
dict2 = {"a":80,"pradeepthi":65,"gokul":79,"c":80}

In [112]:
ser2 = pd.Series(dict2)

In [113]:
ser

ram           80
pradeepthi    65
gokul         79
mahati        80
dtype: int64

In [114]:
ser+ser2

a               NaN
c               NaN
gokul         158.0
mahati          NaN
pradeepthi    130.0
ram             NaN
dtype: float64

In [115]:
20+30

50

In [116]:
40+50

90

In [117]:
roll_name={"Goutham":38,"rohan":20,"mohan":30,"ram":45}
ser=pd.Series(roll_name)
ser

Goutham    38
rohan      20
mohan      30
ram        45
dtype: int64

In [118]:
dict3={"john":30,"ram":45,"Dharani":20}
ser3=pd.Series(dict3)
ser3

john       30
ram        45
Dharani    20
dtype: int64

In [119]:
students = ['ram','mohan','kiran']
roll = [1,2,3]
table = pd.Series(data = students, index = roll)

In [120]:
table

1      ram
2    mohan
3    kiran
dtype: object

data =  pd.DataFrame(data(2d),index,columns)

In [121]:
import numpy as np  #[[1,2,3,4],[1,2,3,4],[1,2,3,4],[1,2,3,4]]
data = pd.DataFrame(np.arange(16).reshape(4,4))

In [122]:
data

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [123]:
type(data)

pandas.core.frame.DataFrame

In [124]:
data = pd.DataFrame(np.arange(16).reshape(4,4),index = "a b c d".split(), columns = "x y z w".split())

In [125]:
data

    x   y   z   w
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [126]:
string = "hie hoe are you"
string.split()

['hie', 'hoe', 'are', 'you']

In [127]:
data = pd.DataFrame(np.arange(16).reshape(4,4),index = ['a','b','c','d'], columns = ['x','y','w','z'])

In [128]:
data

    x   y   w   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [129]:
data['w']

a     2
b     6
c    10
d    14
Name: w, dtype: int32

In [130]:
data['z']

a     3
b     7
c    11
d    15
Name: z, dtype: int32

In [131]:
data.w

a     2
b     6
c    10
d    14
Name: w, dtype: int32

In [132]:
data.z

a     3
b     7
c    11
d    15
Name: z, dtype: int32

In [133]:
data[['y','w']]

    y   w
a   1   2
b   5   6
c   9  10
d  13  14

In [134]:
data.loc[['a','b']]

   x  y  w  z
a  0  1  2  3
b  4  5  6  7

In [135]:
data

    x   y   w   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [136]:
data.iloc[2:4,1:]

    y   w   z
c   9  10  11
d  13  14  15

In [137]:
c = [1,2,3,4,5]

In [138]:
data

    x   y   w   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [139]:
data.loc['e'] = [1,2,3,4]

In [140]:
data

    x   y   w   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15
e   1   2   3   4

In [141]:
data

    x   y   w   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15
e   1   2   3   4

In [142]:
data.loc['f'] = [1,2,3,4]

In [143]:
data

    x   y   w   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15
e   1   2   3   4
f   1   2   3   4

In [144]:
data=pd.DataFrame(np.random.rand(56).reshape(7,8))

In [145]:
data

,0,1,2,3,4,5,6,7
0,0.922386,0.703907,0.758993,0.088569,0.843657,0.066000,0.070344,0.897041
1,0.139818,0.723622,0.702139,0.693152,0.071674,0.306134,0.235144,0.394594
2,0.034831,0.287333,0.417931,0.752572,0.228006,0.735716,0.940450,0.790749
3,0.696230,0.583011,0.828478,0.514607,0.985548,0.927312,0.883241,0.678694
4,0.414034,0.918464,0.947226,0.385863,0.020283,0.849375,0.521052,0.200176
5,0.256235,0.495008,0.826772,0.256515,0.265782,0.342735,0.217474,0.016090
6,0.916560,0.411366,0.434070,0.874859,0.703733,0.901313,0.846372,0.082367

In [146]:
data=pd.DataFrame(np.arange(56).reshape(7,8),index="a b c d e f g".split(),columns="i j k l m n o p".split())
data

    i   j   k   l   m   n   o   p
a   0   1   2   3   4   5   6   7
b   8   9  10  11  12  13  14  15
c  16  17  18  19  20  21  22  23
d  24  25  26  27  28  29  30  31
e  32  33  34  35  36  37  38  39
f  40  41  42  43  44  45  46  47
g  48  49  50  51  52  53  54  55

In [147]:
data = np.random.randn(7,8)
df = pd.DataFrame(data = data)
df

,0,1,2,3,4,5,6,7
0,0.871471,0.894065,1.871872,-0.804572,0.377432,0.026361,0.163405,0.077576
1,1.370409,0.498370,0.233528,0.197565,0.310088,-1.557983,-0.563344,0.113282
2,0.327555,-1.634071,-0.199715,-1.114680,-0.267311,1.313364,-0.231058,-0.292236
3,0.482417,0.282832,-2.116147,0.287181,0.268875,-1.060991,0.182271,0.053286
4,0.230623,-0.266904,0.127761,-0.047582,-0.271622,-0.638020,0.484853,0.093880
5,-4.741055,0.825889,0.574371,-0.466266,1.911620,-0.126333,0.039414,0.387748
6,-0.444115,0.309670,0.586268,0.714763,0.641536,1.654546,1.304810,1.475788

In [148]:
data=pd.DataFrame(np.random.rand(7,8),index="a b c d e f g".split(),columns="x y z w l m n v".split())
data

,x,y,z,w,l,m,n,v
a,0.465154,0.848502,0.723829,0.424290,0.029740,0.376301,0.346886,0.739717
b,0.978111,0.332366,0.309945,0.922598,0.391001,0.830695,0.176143,0.877276
c,0.611403,0.948270,0.896607,0.996160,0.675601,0.809663,0.755810,0.246154
d,0.609711,0.835237,0.810465,0.813642,0.484298,0.229909,0.387457,0.549094
e,0.184297,0.024877,0.080128,0.066285,0.613503,0.844275,0.394036,0.277680
f,0.055022,0.071534,0.477261,0.461211,0.943497,0.577262,0.650754,0.080393
g,0.160098,0.488006,0.303666,0.365018,0.131415,0.335365,0.065702,0.785513

In [149]:
a = np.random.randint(1,100,56)

In [150]:
dict_a = {'A':np.random.rand(5),'B':np.random.rand(5),'C':np.random.rand(5)}
df = pd.DataFrame(data = dict_a,index = ['a','b','c','d','e'])
df

          A         B         C
a  0.765362  0.382819  0.468355
b  0.917998  0.587080  0.751673
c  0.023818  0.082182  0.987606
d  0.237201  0.620943  0.698787
e  0.074377  0.180881  0.623373

In [151]:
dict = {"a":[3,4,5,6], "b":[4,5,6,7,],"c":[7,8,9,10],"d":[11,12,13,14]}

In [152]:
data = pd.DataFrame(dict,index = "h j k l".split())

In [153]:
data

   a  b   c   d
h  3  4   7  11
j  4  5   8  12
k  5  6   9  13
l  6  7  10  14

In [154]:
a = pd.DataFrame(np.random.randint(1,100 ,56).reshape(7,8),index = " a b c d e f g".split(),columns = "p q h i j k l m".split())

In [155]:
a

    p   q   h   i   j   k   l   m
a  25  79  77  92  26  68  57  28
b  34  22  44  93  97  23  13  93
c  94   5  66   2  52  50  70  41
d  56  91  82  88  79  58  25  50
e  32  68  65  71   2  27   4  77
f  69  83  38  13  91  52  20  12
g  15  46  41  10  34  33   8  10

In [156]:
a.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, a to g
Data columns (total 8 columns):
p    7 non-null int32
q    7 non-null int32
h    7 non-null int32
i    7 non-null int32
j    7 non-null int32
k    7 non-null int32
l    7 non-null int32
m    7 non-null int32
dtypes: int32(8)
memory usage: 280.0+ bytes

In [157]:
a.iloc[4:,3:]

    i   j   k   l   m
e  71   2  27   4  77
f  13  91  52  20  12
g  10  34  33   8  10

In [158]:
a.iloc[4:,3:]

    i   j   k   l   m
e  71   2  27   4  77
f  13  91  52  20  12
g  10  34  33   8  10

In [159]:
a['new'] = ["34","2","3","4","5","6","7"]

In [160]:
a

    p   q   h   i   j   k   l   m new
a  25  79  77  92  26  68  57  28  34
b  34  22  44  93  97  23  13  93   2
c  94   5  66   2  52  50  70  41   3
d  56  91  82  88  79  58  25  50   4
e  32  68  65  71   2  27   4  77   5
f  69  83  38  13  91  52  20  12   6
g  15  46  41  10  34  33   8  10   7

In [161]:
a.reset_index()

  index   p   q   h   i   j   k   l   m new
0     a  25  79  77  92  26  68  57  28  34
1     b  34  22  44  93  97  23  13  93   2
2     c  94   5  66   2  52  50  70  41   3
3     d  56  91  82  88  79  58  25  50   4
4     e  32  68  65  71   2  27   4  77   5
5     f  69  83  38  13  91  52  20  12   6
6     g  15  46  41  10  34  33   8  10   7

In [162]:
a.set_index('new')

      p   q   h   i   j   k   l   m
new
34   25  79  77  92  26  68  57  28
2    34  22  44  93  97  23  13  93
3    94   5  66   2  52  50  70  41
4    56  91  82  88  79  58  25  50
5    32  68  65  71   2  27   4  77
6    69  83  38  13  91  52  20  12
7    15  46  41  10  34  33   8  10

In [163]:
a.head(2)

    p   q   h   i   j   k   l   m new
a  25  79  77  92  26  68  57  28  34
b  34  22  44  93  97  23  13  93   2

In [164]:
a.tail(2)

    p   q   h   i   j   k   l   m new
f  69  83  38  13  91  52  20  12   6
g  15  46  41  10  34  33   8  10   7

In [165]:
a['q'].describe()

count     7.000000
mean     56.285714
std      32.872046
min       5.000000
25%      34.000000
50%      68.000000
75%      81.000000
max      91.000000
Name: q, dtype: float64

In [166]:
a.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, a to g
Data columns (total 9 columns):
p      7 non-null int32
q      7 non-null int32
h      7 non-null int32
i      7 non-null int32
j      7 non-null int32
k      7 non-null int32
l      7 non-null int32
m      7 non-null int32
new    7 non-null object
dtypes: int32(8), object(1)
memory usage: 336.0+ bytes

In [167]:
a['p'].unique()

array([25, 34, 94, 56, 32, 69, 15], dtype=int64)

In [168]:
a['p'].value_counts()

15    1
94    1
25    1
56    1
69    1
34    1
32    1
Name: p, dtype: int64

In [169]:
a.isnull().any

<bound method DataFrame.any of        p      q      h      i      j      k      l      m    new
a  False  False  False  False  False  False  False  False  False
b  False  False  False  False  False  False  False  False  False
c  False  False  False  False  False  False  False  False  False
d  False  False  False  False  False  False  False  False  False
e  False  False  False  False  False  False  False  False  False
f  False  False  False  False  False  False  False  False  False
g  False  False  False  False  False  False  False  False  False>

In [170]:
a.isnull().any()

p      False
q      False
h      False
i      False
j      False
k      False
l      False
m      False
new    False
dtype: bool

In [171]:
a

    p   q   h   i   j   k   l   m new
a  25  79  77  92  26  68  57  28  34
b  34  22  44  93  97  23  13  93   2
c  94   5  66   2  52  50  70  41   3
d  56  91  82  88  79  58  25  50   4
e  32  68  65  71   2  27   4  77   5
f  69  83  38  13  91  52  20  12   6
g  15  46  41  10  34  33   8  10   7

In [172]:
a.drop('new',axis = 1)

    p   q   h   i   j   k   l   m
a  25  79  77  92  26  68  57  28
b  34  22  44  93  97  23  13  93
c  94   5  66   2  52  50  70  41
d  56  91  82  88  79  58  25  50
e  32  68  65  71   2  27   4  77
f  69  83  38  13  91  52  20  12
g  15  46  41  10  34  33   8  10

In [173]:
a

    p   q   h   i   j   k   l   m new
a  25  79  77  92  26  68  57  28  34
b  34  22  44  93  97  23  13  93   2
c  94   5  66   2  52  50  70  41   3
d  56  91  82  88  79  58  25  50   4
e  32  68  65  71   2  27   4  77   5
f  69  83  38  13  91  52  20  12   6
g  15  46  41  10  34  33   8  10   7

In [174]:
a.drop('new',axis = 1)

    p   q   h   i   j   k   l   m
a  25  79  77  92  26  68  57  28
b  34  22  44  93  97  23  13  93
c  94   5  66   2  52  50  70  41
d  56  91  82  88  79  58  25  50
e  32  68  65  71   2  27   4  77
f  69  83  38  13  91  52  20  12
g  15  46  41  10  34  33   8  10

In [177]:
a.drop('new',axis = 1,inplace = True)

In [178]:
a<6

       p      q      h      i      j      k      l      m
a  False  False  False  False  False  False  False  False
b  False  False  False  False  False  False  False  False
c  False   True  False   True  False  False  False  False
d  False  False  False  False  False  False  False  False
e  False  False  False  False   True  False   True  False
f  False  False  False  False  False  False  False  False
g  False  False  False  False  False  False  False  False

In [179]:
dataset = a[a>6]

In [180]:
dataset

    p     q   h     i     j   k     l   m
a  25  79.0  77  92.0  26.0  68  57.0  28
b  34  22.0  44  93.0  97.0  23  13.0  93
c  94   NaN  66   NaN  52.0  50  70.0  41
d  56  91.0  82  88.0  79.0  58  25.0  50
e  32  68.0  65  71.0   NaN  27   NaN  77
f  69  83.0  38  13.0  91.0  52  20.0  12
g  15  46.0  41  10.0  34.0  33   8.0  10

In [181]:
dataset.isnull().any()

p    False
q     True
h    False
i     True
j     True
k    False
l     True
m    False
dtype: bool

In [182]:
dataset.fillna(dataset['q'].mean(),inplace = True)
dataset.fillna(dataset['h'].median(),inplace = True)
dataset.fillna(dataset['m'].median(),inplace = True)

In [183]:
dataset

    p          q   h          i          j   k          l   m
a  25  79.000000  77  92.000000  26.000000  68  57.000000  28
b  34  22.000000  44  93.000000  97.000000  23  13.000000  93
c  94  64.833333  66  64.833333  52.000000  50  70.000000  41
d  56  91.000000  82  88.000000  79.000000  58  25.000000  50
e  32  68.000000  65  71.000000  64.833333  27  64.833333  77
f  69  83.000000  38  13.000000  91.000000  52  20.000000  12
g  15  46.000000  41  10.000000  34.000000  33   8.000000  10

In [184]:
dataset.isnull().any()

p    False
q    False
h    False
i    False
j    False
k    False
l    False
m    False
dtype: bool

In [185]:
import pandas as pd 
import numpy as np
p = pd.DataFrame({"name":["pratyusha","sindhu",np.NaN,np.NaN,"sindhu","sruthi","sruthi"]})

In [186]:
p

        name
0  pratyusha
1     sindhu
2        NaN
3        NaN
4     sindhu
5     sruthi
6     sruthi

In [187]:
p.isnull().any

<bound method DataFrame.any of     name
0  False
1  False
2   True
3   True
4  False
5  False
6  False>

In [188]:
s = p['name'].mode()

In [189]:
s[0]

'sindhu'

In [190]:
p.fillna(p['name'].mode()[0],inplace = True)

In [191]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, a to g
Data columns (total 8 columns):
p    7 non-null int32
q    7 non-null float64
h    7 non-null int32
i    7 non-null float64
j    7 non-null float64
k    7 non-null int32
l    7 non-null float64
m    7 non-null int32
dtypes: float64(4), int32(4)
memory usage: 392.0+ bytes

In [ ]:
p

In [ ]:
s[1]